---
kind: method
id: M:Autodesk.Revit.DB.Electrical.ElectricalSystem.GetCircuitPath
source: html/0448a0ee-c9bf-f037-c1b7-d49ce03ffa71.htm
---
# Autodesk.Revit.DB.Electrical.ElectricalSystem.GetCircuitPath Method

Gets the list of the electrical system circuit path node position.

## Syntax (C#)
```csharp
public IList<XYZ> GetCircuitPath()
```

## Returns
The list of the electrical system circuit path node position.